---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsRunStyle.Spiral
enum: Autodesk.Revit.DB.Architecture.StairsRunStyle
source: html/1dc06f71-259c-1fb1-2fd7-6fa449f628e0.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunStyle.Spiral

A spiral run is defined by a cylindrical helix. Both inner and outer boundaries are arcs. Risers are straight lines.